ddd: fix exo contexts
